app/admin/candidate_criterium_scores.rb

      end

      row "Полное имя" do
        "#{resource.candidate.first_name} #{resource.candidate.second_name}"
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]