app/admin/criteria.rb


      table_for cs do
        column("Кандидат") { |c| auto_link c.candidate  }
        column("Полное имя") { |c| "#{c.candidate.first_name} #{c.candidate.second_name}" }
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]