app/admin/positions.rb

SELECT "vacancies".* FROM "vacancies" WHERE "vacancies"."position_id" = $1  [["position_id", 5]]
---
      panel 'Вакансии' do
        vs = resource.vacancies

        vs.map do |v|