app/admin/users.rb

    end

    panel 'Рассматриваемые кандидаты' do
      user.candidates.map do |candidate|
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."user_id" = $1  [["user_id", 6]]