app/helpers/joke_helper.rb

SELECT COUNT(*) FROM "jokes"
SELECT "jokes".* FROM "jokes" ORDER BY "jokes"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 10]]
---
  def random_joke
      count = Joke.count
      random_offset = rand(count)
      Joke.offset(random_offset).first.body