app/controllers/candidates_controller.rb

  def index

    if params[:filter].nil?
      if params[:vacancy_id].nil?
        @prefix = "Все"
        @c = Candidate.all
      else
        @c = Candidate.where(vacancy_id: params[:vacancy_id].to_i)
        @prefix = "\"#{Vacancy.find(params[:vacancy_id].to_i).position.name}\""
      end

    else
      case  params[:filter]
      when "rejected"
        @c = Candidate.where(status: 0)
        @prefix = "Отклонённые"
      when "reviewed"
        @c = Candidate.where(status: 1)
        @prefix = "Рассматриваемые"
      when "accepted"
        @c = Candidate.where(status: 2)
        @prefix = "Принятые"
      end
    end

    @cr = Criterium.all
    @v = Vacancy.all

    @data_chart = [["Приняты", Candidate.accepted.count],
    ["Отклонены",Candidate.rejected.count],
    ["Рассматриваются", Candidate.reviewed.count]]
---
SELECT "candidates".* FROM "candidates"
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "vacancies".* FROM "vacancies" WHERE "vacancies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "vacancies".* FROM "vacancies"
SELECT COUNT(*) FROM "candidates"