app/controllers/positions_controller.rb

  def index
    @p = Position.all
    @pc = PositionCriteriumScore.all
---
SELECT "positions".* FROM "positions"
SELECT "position_criterium_scores".* FROM "position_criterium_scores" WHERE "position_criterium_scores"."position_id" = $1  [["position_id", 1]]