app/controllers/vacancies_controller.rb

SELECT "vacancies".* FROM "vacancies" ORDER BY "vacancies"."status" ASC
SELECT "positions".* FROM "positions"
---
  def index
      @v = Vacancy.order(:status)
      @p = Position.all