app/models/candidate.rb

    def score_sum
      self.candidate_criterium_scores.to_a.sum(&:score)
---
SELECT "candidate_criterium_scores".* FROM "candidate_criterium_scores" WHERE "candidate_criterium_scores"."candidate_id" = $1  [["candidate_id", 1]]