app/controllers/users/sessions_controller.rb

  def create

    user = User.find_by_email(params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "dfgdfgdfg"], ["LIMIT", 1]]